app/controllers/keywords_controller.rb

  def index
    @my_keywords = current_user.keywords

    @all_keywords= Keyword.all - @my_keywords
---
SELECT * FROM `keywords` INNER JOIN `keywords_users` ON `keywords`.id = `keywords_users`.keyword_id WHERE (`keywords_users`.user_id = 2 )

  def attach
    keyword_id = params[:id]
    # check to make sure we dont already have this one
    keyword = Keyword.find(keyword_id)
---
SELECT * FROM `keywords` WHERE (`keywords`.`id` = 1)

  def remove
    keyword = Keyword.find(params[:id])
---
SELECT * FROM `keywords` WHERE (`keywords`.`id` = 3)

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT * FROM `keywords` WHERE (`keywords`.`id` = 1)

  def create
    @keyword = Keyword.new(params[:keyword])
    @keyword.users << current_user
---
INSERT INTO `keywords` (`created_at`, `word`, `updated_at`) VALUES('2010-09-20 02:54:57', 'investing', '2010-09-20 02:54:57')