app/controllers/users_controller.rb

  def stats

#    @recent_friendings = recent_followed_usernames(current_user)
    @recent_friendings = Friending.find_all_by_user_id(current_user.id,:order=>"created_at")
---
SELECT * FROM `friendings` WHERE (`friendings`.`user_id` = 1) ORDER BY created_at